Autodesk.Revit.DB.FDXBaseExportOptions.CategoryFilter
The category filter to be used during export.

Autodesk.Revit.DB.FDXBaseExportOptions.ExportRooms
Indicates whether the exported data should contain Room information.

Autodesk.Revit.DB.FDXBaseExportOptions.IsIncrementalExport
Indicates whether export will be performed incrementally.

Autodesk.Revit.DB.FDXBaseExportOptions
The base export options used for exporting to an FDX exchange or local JSON payload.